iproute2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 13:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>iproute2</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">iproute2</h1>
<p>
iproute2, better known as the <code>ip</code> command, is a replacement for the
old <code>route</code> and <code>ipconfig</code> utilities.
</p>

<p>
it lets you abbreviate subcommands, ie <code>ip route</code> -&gt; <code>ip r</code>, <code>ip
address</code> -&gt; <code>ip a</code>.
</p>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">1.</span> routes</h2>
<div class="outline-text-2" id="text-1">
<pre class="example" id="org0000000">
ip r
</pre>
<p>
will list the current routes.
</p>

<p>
add <code>-6</code> to show for ipv6
</p>
<pre class="example" id="org0000000">
ip -6 r
</pre>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> adding a route</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example" id="org0000000">
ip r add default via 192.168.1.1
</pre>
<p>
adds a <code>default</code> route to a gateway at <code>192.168.1.1</code>. a CIDR can be
used instead of <code>default</code>. <code>default</code> is
roughly equivalent to a <code>0.0.0.0/0</code> plus a <code>::/0</code> route.
</p>

<p>
<code>dev devicename</code> can be added to restrict it to <code>devicename</code>.
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.2.</span> deleting a route</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example" id="org0000001">
ip r del default
</pre>
<p>
will delete the default route.
</p>
</div>
</div>
</div>

<div id="outline-container-org0000004" class="outline-2">
<h2 id="org0000004"><span class="section-number-2">2.</span> addresses</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org0000003">
ip a
</pre>
<p>
will list the addresses and status of your networking devices.
</p>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">2.1.</span> down/up</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example" id="org0000003">
ip link set wlan0 up
</pre>
<p>
will set device <code>wlan0</code> up.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
